cmsis-svd/cmsis-svd/data/Spansion/MB9BF12xK.svd
        <!-- REGISTER "EPFR11" -->
        <register>
          <name>EPFR11</name>
          <description>Extended pin function setting register 11</description>
          <addressOffset>0x62C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR12" -->
        <register>
          <name>EPFR12</name>
          <description>Extended pin function setting register 12</description>
          <addressOffset>0x630</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR13" -->
        <register>
          <name>EPFR13</name>
          <description>Extended pin function setting register 13</description>
          <addressOffset>0x634</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR14" -->
        <register>
          <name>EPFR14</name>
          <description>Extended pin function setting register 14</description>
          <addressOffset>0x638</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR15" -->
        <register>
          <name>EPFR15</name>
          <description>Extended pin function setting register 15</description>
          <addressOffset>0x63C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT21S" -->
            <field>
              <name>EINT21S</name>
              <description>External interrupt 21 input select bit</description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT20S" -->
            <field>
              <name>EINT20S</name>
              <description>External interrupt 20 input select bit</description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT19S" -->
            <field>
              <name>EINT19S</name>
              <description>External interrupt 19 input select bit</description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT18S" -->
            <field>
              <name>EINT18S</name>
              <description>External interrupt 18 input select bit</description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT17S" -->
            <field>
              <name>EINT17S</name>
              <description>External interrupt 17 input select bit</description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT16S" -->
            <field>
              <name>EINT16S</name>
              <description>External interrupt 16 input select bit</description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "EPFR16" -->
        <register>
          <name>EPFR16</name>
          <description>Extended pin function setting register 16</description>
          <addressOffset>0x640</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR17" -->
        <register>
          <name>EPFR17</name>
          <description>Extended pin function setting register 17</description>
          <addressOffset>0x644</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "EPFR18" -->
        <register>
          <name>EPFR18</name>
          <description>Extended pin function setting register 18</description>
          <addressOffset>0x648</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
        </register>
        <!-- REGISTER "PZR6" -->
        <register>
          <name>PZR6</name>
          <description>Port Pseudo Open Drain Setting Register 6</description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P0" -->
            <field>
              <name>P0</name>
              <description>Bit0 of PZR6</description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LVD" -->
    <peripheral>
      <name>LVD</name>
      <description>Low-voltage Detection</description>
      <groupName>LVD</groupName>
      <baseAddress>0x40035000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "LVD" -->
      <interrupt>
        <name>LVD</name>
        <value>2</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LVD_CTL" -->
        <register>
          <name>LVD_CTL</name>
          <description>Low-voltage Detection Voltage Control Register</description>
          <addressOffset>0x0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x8010</resetValue>
          <resetMask>0xFCFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDRE" -->
            <field>
              <name>LVDRE</name>
              <description>Low-voltage detection reset operation enable bit</description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVHR" -->
            <field>
              <name>SVHR</name>
              <description>Low-voltage detection reset voltage setting bits</description>
              <lsb>10</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LVDIE" -->
            <field>
              <name>LVDIE</name>
              <description>Low-voltage detection interrupt enable bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVHI" -->
            <field>
              <name>SVHI</name>
              <description>Low-voltage detection interrupt voltage setting bits</description>
              <lsb>2</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_STR" -->
        <register>
          <name>LVD_STR</name>
          <description>Low-voltage Detection Interrupt Register</description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x80</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDIR" -->
            <field>
              <name>LVDIR</name>
              <description>Low-voltage detection interrupt bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_CLR" -->
        <register>
          <name>LVD_CLR</name>
          <description>Low-voltage Detection Interrupt Clear Register</description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x80</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDCL" -->
            <field>
              <name>LVDCL</name>
              <description>Low-voltage detection interrupt clear bit</description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
